
qwerty_map = {
    'カ':'t',
    'キ':'g',
    'ク':'h',
    'ケ':"'",
    'コ':'b',
    'サ':'x',
    'シ':'d',
    'ス':'r',
    'セ':'p',
    'ソ':'c',
    'タ':'q',
    'チ':'a',
    'ツ':'z',
    'テ':'w',
    'ト':'s',
    'ハ':'f',
    'ヒ':'v',
    'フ':'2',
    'ヘ':'=',
    'ホ':'-',
    'ヤ':'7',
    'ユ':'8',
    'ヨ':'9',
    'ア':'3',
    'イ':'e',
    'ウ':'4',
    'エ':'5',
    'オ':'6',
    'ラ':'o',
    'リ':'l',
    'リ':'l',
    'リ':'l',
    'ル':'.',
    'レ':';',
    'ロ':'`',
    'マ':'j',
    'ミ':'n',
    'ム':'\\',
    'メ':'/',
    'モ':'m',
    'ナ':'u',
    'ニ':'i',
    'ヌ':'1',
    'ネ':',',
    'ノ':'k',
    'ワ':'0',
    'ヲ':')',
    'ン':'y',
    'ー':'_',
    '。':'>',
    '、':'<',
    '「':'}',
    '」':'|',
    '・':'?',
    '゛':'[',
    '゜':']'
}

def qwerty_remap(string):
    res = ""
    for c in string:
        if c != '\n':
            res += qwerty_map.get(c,c)
    return res

with open('layout.txt', 'r') as f:
    for line in f:
        print(qwerty_remap(line))
